Repository: alano332/tt_utilities
Catalog: locales/*/LC_MESSAGES/messages.po
Languages: ar, pt

source: Invalid command format: {e}
ar: تنسيق الأمر غير صالح: {e}
pt: Formato de comando inválido: {e}

source: {nickname} has been banned for {duration}.
ar: تم حظر {nickname} لمدة {duration}.

source: Invalid duration format
ar: تنسيق المدة غير صالح

source: {nickname} (IP ban) has been unbanned.
ar: تم رفع الحظر عن {nickname} (حظر IP).

source: {nickname} (Username ban) has been unbanned.
ar: تم رفع الحظر عن {nickname} (اسم المستخدم المحظور).

source: {nickname} has been jailed.
ar: لقد تم سجن {الاسم المستعار}.

source: Invalid command. Usage: /jail <nickname>
ar: أمر غير صالح. الاستخدام: /jail <nickname>
pt: Comando inválido. Uso: /jail <apelido>

source: {nickname} has been unjailed.
ar: لقد تم إطلاق سراح {nickname} من السجن.

source: Invalid command. Usage: /unjail <nickname>
ar: أمر غير صالح. الاستخدام: /unjail <nickname>
pt: Comando inválido. Uso: /unjail <apelido>

source: Bot name changed to '{new_name}'.
ar: تم تغيير اسم البوت إلى '{new_name}'.
pt: O nome do bot foi alterado para '{new_name}'.

source: Please provide a new name.
ar: يرجى تقديم اسم جديد.
pt: Forneça um novo nome.

source: Invalid command. Usage: /cn <new_name>
ar: أمر غير صالح. الاستخدام: /cn <new_name>
pt: Comando inválido. Uso: /cn <novo_nome>

source: Success
ar: نجاح
pt: Sucesso

source: Please provide a message.
ar: يرجى تقديم رسالة.
pt: Por favor, forneça uma mensagem.

source: Invalid command. Usage: /cs <new_status>
ar: أمر غير صالح. الاستخدام: /cs <new_status>
pt: Comando inválido. Uso: /cs <novo_status>

source: Available modes are: m for male, f for female, n for neutral.
ar: الأوضاع المتاحة هي: m للذكر، f للأنثى، n للمحايد.
pt: Os modos disponíveis são: m para masculino, f para feminino, n para neutro.

source: Invalid command. Usage: /cg gender. Available modes: m for male, f for female, n for neutral.
ar: أمر غير صالح. الاستخدام: /cg الجنس. الأوضاع المتاحة: m للذكر، f للأنثى، n للمحايد.
pt: Comando inválido. Uso: /cg gênero. Modos disponíveis: m para masculino, f para feminino, n para neutro.

source: Bot configuration saved.
ar: تم حفظ تكوين الروبوت.
pt: Configuração do bot salva.

source: Jailed users: {jailed_users}
ar: المستخدمون المسجونون: {jailed_users}

source: No users are currently jailed.
ar: لا يوجد أي مستخدم مسجون حاليا.
pt: Nenhum usuário está preso no momento.

source: Cleared bans and duration kicks for {target}.
ar: تمت إزالة الحظر وإيقاف المدة لـ {target}.

source: Cleared duration kick for {target}.
ar: تمت الموافقة على ركلة المدة لـ {target}.

source: Target '{target}' not found.
ar: لم يتم العثور على الهدف '{target}'.

source: KeyError during clear_all: {e}
ar: KeyError أثناء مسح الكل: {e}
pt: KeyError durante limpar_todos: {e}

source: Cleared all bans and duration kicks.
ar: تم إزالة جميع الحظر و الركلات المؤقتة.
pt: Todos os banimentos e chutes de duração foram eliminados.

source: Error during unban_user: {e}
ar: خطأ أثناء إلغاء حظر المستخدم: {e}
pt: Erro durante desbanir_user: {e}

source: KeyError during clear_kick_duration: {e}
ar: KeyError أثناء clear_kick_duration: {e}
pt: KeyError durante limpar_chute_de_duração: {e}

source: Message from administrators: {message}
ar: رسالة من المسؤولين: {message}
pt: Mensagem dos administradores: {message}

source: Error: {error} for IP: {ip_address}
ar: خطأ: {error} لعنوان IP: {ip_address}

source: Error checking VPN status: {e} for IP: {ip_address}
ar: خطأ في التحقق من حالة VPN: {e} لعنوان IP: {ip_address}
pt: Erro ao verificar o status da VPN: {e} para IP: {ip_address}

source: Server Address
ar: عنوان الخادم
pt: Endereço do servidor

source: Server Port
ar: منفذ الخادم
pt: Porta do servidor

source: Encrypted server
ar: الخادم المشفر
pt: Servidor criptografado

source: Bot Username
ar: اسم مستخدم البوت
pt: Nome de usuário do bot

source: Bot Password
ar: كلمة مرور البوت
pt: Senha do bot

source: Bot Nickname
ar: لقب البوت
pt: Apelido do bot

source: Bot Client Name
ar: اسم عميل الروبوت
pt: Nome do cliente do bot

source: Bot Gender
ar: جنس البوت
pt: Gênero do bot

source: Male
ar: ذكر
pt: Masculino

source: Female
ar: أنثى
pt: Feminino

source: Neutral
ar: حيادي
pt: Neutro

source: Default channel to join after login:
ar: القناة الافتراضية للانضمام بعد تسجيل الدخول:
pt: Canal padrão para entrar após o login:

source: Channel password
ar: كلمة مرور القناة
pt: Senha do canal

source: Bot Status Message
ar: رسالة حالة الروبوت
pt: Mensagem de status do bot

source: Enable VPN detection
ar: تمكين اكتشاف VPN
pt: Habilitar detecção de VPN

source: Automatically kick users with no name
ar: طرد المستخدمين الذين ليس لديهم اسم تلقائيًا
pt: Expulsar automaticamente usuários sem nome

source: Default message that will be sent to users with no name when they login
ar: الرسالة الافتراضية التي سيتم إرسالها للمستخدمين الذين ليس لديهم اسم عند تسجيل الدخول
pt: Mensagem padrão que será enviada para usuários sem nome quando eles fizerem login

source: Enable intercepting channel messages for all users: Useful for detecting bad words in all channels as well as allowing some commands to work regardless of the bot's channel
ar: تمكين اعتراض رسائل القناة لجميع المستخدمين: مفيد للكشف عن الكلمات السيئة في جميع القنوات بالإضافة إلى السماح لبعض الأوامر بالعمل بغض النظر عن قناة الروبوت
pt: Habilite a interceptação de mensagens do canal para todos os usuários: Útil para detectar palavrões em todos os canais, bem como permitir que alguns comandos funcionem independentemente do canal do bot

source: Jail Users (comma-separated)
ar: مستخدمو السجن (مفصولة بفواصل)
pt: Usuários de prisão (separados por vírgula)

source: Jail Nicknames (comma-separated)
ar: ألقاب السجن (مفصولة بفاصلة)
pt: Apelidos de prisão (separados por vírgula)

source: Jail Channel Path
ar: مسار قناة السجن
pt: Caminho do Canal da Prisão

source: Jail Timeout (seconds)
ar: مهلة السجن (ثواني)
pt: Tempo limite da prisão (segundos)

source: Jail Flood Count
ar: عدد السجناء في السجون
pt: Contagem de inundações na prisão

source: Random Message Interval
ar: الفاصل الزمني للرسائل العشوائية
pt: Intervalo de mensagens aleatórias

source: Character Limit for Nicknames
ar: حد الأحرف للألقاب
pt: Limite de caracteres para apelidos

source: Action for Long Nicknames
ar: إجراءات بشأن الألقاب الطويلة
pt: Ação para apelidos longos

source: Kick the user
ar: طرد المستخدم
pt: Chute o usuário

source: Ban the user
ar: حظر المستخدم
pt: Banir o usuário

source: Action for Blacklisted Nicknames or words
ar: الإجراءات الخاصة بالألقاب أو الكلمات المدرجة في القائمة السوداء
pt: Ação para apelidos ou palavras na lista negra

source: Specify the timer for automatic video deletion after upload. Set it to 0 to disable automatic deleting of uploaded videos.
ar: حدد مؤقتًا للحذف التلقائي للفيديو بعد التحميل. اضبطه على 0 لتعطيل الحذف التلقائي للفيديوهات التي تم تحميلها.
pt: Especifique o cronômetro para exclusão automática do vídeo após o upload. Defina como 0 para desativar a exclusão automática de vídeos enviados.

source: Specify the list of banned or disallowed countries from entering the server. Separated with comma.
ar: حدد قائمة الدول المحظورة أو غير المسموح لها بالدخول إلى الخادم. مفصولة بفاصلة.

source: Input Device
ar: جهاز الإدخال
pt: Dispositivo de entrada

source: Output Device
ar: جهاز الإخراج
pt: Dispositivo de saída

source: Seek step, in seconds:
ar: ابحث عن الخطوة، بالثواني:
pt: Tempo para avançar/retroceder a música (em segundos).

source: Default volume
ar: الحجم الافتراضي
pt: Volume padrão

source: Max volume
ar: الحد الأقصى للحجم
pt: Volume máximo

source: Enter a telegram bot token, Optional:
ar: أدخل رمز بوت التلجرام، اختياري:
pt: Insira um token de bot de telegram, opcional:

source: Exclusion IPs (comma-separated)
ar: عناوين IP المستبعدة (مفصولة بفاصلة)
pt: IPs de exclusão (separados por vírgula)

source: Exclusion Usernames (comma-separated)
ar: استبعاد أسماء المستخدمين (مفصولة بفاصلة)
pt: Nomes de usuário de exclusão (separados por vírgula)

source: Exclusion Nicknames (comma-separated)
ar: ألقاب الاستبعاد (مفصولة بفاصلة)
pt: Apelidos de exclusão (separados por vírgula)

source: Weather API Key
ar: مفتاح API للطقس
pt: Chave da API meteorológica

source: SSH Hostname
ar: اسم مضيف SSH
pt: Endereço do servidor SSH

source: SSH Port
ar: منفذ SSH
pt: Porta do servidor SSH

source: SSH Username
ar: اسم مستخدم SSH
pt: Nome de usuário SSh do seu Servidor

source: SSH Password
ar: كلمة مرور SSH
pt: Senha do Seu usuário SSH

source: List of allowed IPs to execute ssh commands:
ar: قائمة عناوين IP المسموح لها بتنفيذ أوامر ssh:
pt: Lista de IPs permitidos para executar comandos ssh:

source: Detection Mode
ar: وضع الكشف
pt: Modo de detecção

source: Guest Accounts
ar: حسابات الضيوف
pt: Contas de visitantes

source: All Accounts
ar: جميع الحسابات
pt: Todas as contas

source: Custom Username Account
ar: اسم المستخدم المخصص للحساب
pt: Conta de nome de usuário personalizado

source: Custom Username
ar: اسم المستخدم المخصص
pt: Nome de usuário personalizado

source: This field is only required if 'Custom Username Account' is selected above.
ar: هذا الحقل مطلوب فقط إذا تم تحديد "حساب اسم المستخدم المخصص" أعلاه.
pt: Este campo só é obrigatório se 'Conta de nome de usuário personalizado' estiver selecionado acima.

source: Authorized Usernames (comma-separated)
ar: أسماء المستخدمين المصرح لهم (مفصولة بفاصلة)
pt: Nomes de usuário autorizados (separados por vírgula)

source: Detect server administrators as bot's authorized users
ar: الكشف عن مسؤولي الخادم باعتبارهم مستخدمين معتمدين للبوت
pt: Detecte administradores de servidor como usuários autorizados do bot

source: License name
ar: اسم الترخيص
pt: Nome da licença

source: License key
ar: مفتاح الترخيص
pt: Chave de licença

source: Back
ar: خلف
pt: Voltar

source: Next
ar: التالي
pt: Próximo

source: Save
ar: يحفظ
pt: Salvar

source: Review your configuration settings. Press finish to confirm
ar: قم بمراجعة إعدادات التكوين الخاصة بك. اضغط على "إنهاء" للتأكيد
pt: Revise suas definições de configuração. Pressione finalizar para confirmar

source: Finish
ar: ينهي
pt: Terminar

source: label
ar: ملصق

source: default
ar: تقصير

source: Visit the website to Get a weather API key
ar: قم بزيارة الموقع الإلكتروني للحصول على مفتاح API للطقس
pt: Visite o site para obter uma chave de API meteorológica

source: Congratulations. The config file has been created successfully. Please run the bot again!.
ar: مبروك. تم إنشاء ملف التكوين بنجاح. يرجى تشغيل الروبوت مرة أخرى!
pt: Parabéns. O arquivo de configuração foi criado com sucesso. Por favor, execute o bot novamente!

source: You're all done.
ar: لقد انتهيت من كل شيء.
pt: Está tudo pronto.

source: Welcome to TeamTalk utilities bot, a powerful bot, not just for spammers
ar: مرحبًا بك في برنامج TeamTalk Utilities bot، وهو برنامج روبوت قوي، ليس فقط لمرسلي البريد العشوائي
pt: Bem-vindo ao bot de utilitários TeamTalk, um bot poderoso, não apenas para spammers

source: Since it's the first time you open the bot: it will ask you some questions to create the config file, Please follow the instructions carefully and be sure to enter all info correctly.
ar: نظرًا لأنها المرة الأولى التي تفتح فيها الروبوت: فسوف يسألك بعض الأسئلة لإنشاء ملف التكوين، يرجى اتباع التعليمات بعناية والتأكد من إدخال جميع المعلومات بشكل صحيح.
pt: Como é a primeira vez que você abre o bot: ele fará algumas perguntas para criar o arquivo de configuração. Siga as instruções com atenção e certifique-se de inserir todas as informações corretamente.

source: Server info:
ar: معلومات الخادم:
pt: Informações do servidor:

source: Enter server address:
ar: أدخل عنوان الخادم:
pt: Digite o endereço do servidor:

source: Error: Server address cannot be blank. Please try again.
ar: خطأ: لا يمكن ترك عنوان الخادم فارغًا. يرجى المحاولة مرة أخرى.
pt: Erro: O endereço do servidor não pode ficar em branco. Por favor, tente novamente.

source: Enter server port:
ar: أدخل منفذ الخادم:
pt: Insira a porta do servidor:

source: Error: Invalid server port. Please enter a number.
ar: خطأ: منفذ الخادم غير صالح. الرجاء إدخال رقم.
pt: Erro: Porta do servidor inválida. Insira um número.

source: Error: Server port cannot be blank. Please try again.
ar: خطأ: لا يمكن أن يكون منفذ الخادم فارغًا. يرجى المحاولة مرة أخرى.
pt: Erro: a porta do servidor não pode ficar em branco. Por favor, tente novamente.

source: Choose your server type:
ar: اختر نوع الخادم الخاص بك:
pt: Escolha o tipo de servidor:

source: 1: unencrypted server
ar: 1: خادم غير مشفر
pt: 1: servidor não criptografado

source: 2: encrypted server
ar: 2: خادم مشفر
pt: 2: servidor criptografado

source: Enter your choice:
ar: أدخل اختيارك:
pt: Digite sua escolha:

source: Invalid choice
ar: اختيار غير صالح
pt: Escolha inválida

source: Enter bot username:
ar: أدخل اسم مستخدم البوت:
pt: Digite o nome de usuário do bot:

source: Error: username cannot be blank, Please try again
ar: خطأ: لا يمكن أن يكون اسم المستخدم فارغًا، يرجى المحاولة مرة أخرى
pt: Erro: o nome de usuário não pode ficar em branco. Tente novamente

source: Enter bot password:
ar: أدخل كلمة مرور البوت:
pt: Digite a senha do bot:

source: Error: Please type the password
ar: خطأ: الرجاء كتابة كلمة المرور
pt: Erro: Por favor digite a senha

source: Done, now: Please enter the exclution IP addresses you want to exclude, seperate with a comma between each IP
ar: تم الآن: يرجى إدخال عناوين IP المستبعدة التي تريد استبعادها، مع الفصل بينها بفاصلة بين كل عنوان IP
pt: Pronto, agora: insira os endereços IP de exclusão que deseja excluir, separados por vírgula entre cada IP

source: Enter exclusion IPs (comma-separated):
ar: أدخل عناوين IP المستبعدة (مفصولة بفاصلة):
pt: Insira os IPs de exclusão (separados por vírgula):

source: Enter usernames to exclude (comma-separated, leave blank to disable):
ar: أدخل أسماء المستخدمين التي تريد استبعادها (مفصولة بفاصلة، اتركها فارغة لتعطيلها):
pt: Insira os nomes de usuário a serem excluídos (separados por vírgula, deixe em branco para desativar):

source: Enter nicknames to exclude (comma-separated, leave blank to disable):
ar: أدخل الألقاب التي تريد استبعادها (مفصولة بفاصلة، اتركها فارغة لتعطيلها):
pt: Insira os apelidos a serem excluídos (separados por vírgula, deixe em branco para desativar):

source: Bot details
ar: تفاصيل البوت
pt: Detalhes do bot

source: Enter bot nickname:
ar: أدخل اسم البوت:
pt: Digite o apelido do bot:

source: Error: nickname cannot be blank
ar: خطأ: لا يمكن ترك الاسم المستعار فارغًا
pt: Erro: o apelido não pode ficar em branco

source: Enter bot client name:
ar: أدخل اسم عميل الروبوت:
pt: Insira o nome do cliente do bot:

source: Client name can't be blank
ar: لا يمكن أن يكون اسم العميل فارغًا
pt: O nome do cliente não pode ficar em branco

source: Choose the bot's gender:
ar: اختر جنس البوت:
pt: Escolha o gênero do bot:

source: 1: male
ar: 1: ذكر
pt: 1: masculino

source: 2: female
ar: 2: أنثى
pt: 2: feminino

source: 3: neutral
ar: 3: محايد
pt: 3: neutro

source: Error, Invalid choice
ar: خطأ، اختيار غير صالح
pt: Erro, escolha inválida

source: Invalid choice
ar: اختيار غير صالح
pt: Escolha inválida

source: Default channel:
ar: القناة الافتراضية:
pt: Canal padrão:

source: Defaulting to root channel
ar: التعيين افتراضيًا على قناة الجذر
pt: Padrão para canal raiz

source: Channel password:
ar: كلمة مرور القناة:
pt: Senha do canal:

source: Optionally: Please enter a status message for the bot, Leave blank to set a blank status:
ar: اختياريًا: يرجى إدخال رسالة حالة للبوت، اترك الحقل فارغًا لتعيين حالة فارغة:
pt: Opcionalmente: insira uma mensagem de status para o bot. Deixe em branco para definir um status em branco:

source: Do you want to enable VPN detection? y / n:
ar: هل تريد تفعيل خاصية اكتشاف VPN؟ y/n:
pt: Deseja ativar a detecção de VPN? S/n:

source: y
ar: ي

source: n
ar: ن

source: Invalid input
ar: إدخال غير صالح
pt: Entrada inválida

source: Do you want to enable automatic kicking of no name users or users who enter with no name set? Y / N:
ar: هل تريد تفعيل الطرد التلقائي للمستخدمين الذين ليس لديهم اسم أو المستخدمين الذين يدخلون بدون اسم محدد؟ Y / N:
pt: Você deseja ativar a exclusão automática de usuários sem nome ou de usuários que entram sem nome definido? S/N:

source: Enter the default note that will be sent to a user who enters with no name set:
ar: أدخل الملاحظة الافتراضية التي سيتم إرسالها إلى المستخدم الذي يدخل بدون تعيين اسم:
pt: Insira a nota padrão que será enviada para um usuário que entrar sem nome definido:

source: Using the default message
ar: استخدام الرسالة الافتراضية
pt: Usando a mensagem padrão

source: Do you want the bot to automatically intercept channel messages for users? This is useful if you want some commands to work regardless of the bot's channel, And also useful for detecting bad words in any other channel the bot is not in: Y / N
ar: هل تريد أن يقوم البوت باعتراض رسائل القنوات للمستخدمين تلقائيًا؟ هذا مفيد إذا كنت تريد أن تعمل بعض الأوامر بغض النظر عن قناة البوت، ومفيد أيضًا لاكتشاف الكلمات السيئة في أي قناة أخرى لا يتواجد فيها البوت: نعم / لا
pt: Você deseja que o bot monitore automaticamente as mensagens do canalde todos os usuários conectados? Isso é útil se você deseja que alguns comandos funcionem independentemente do canal do bot, e também útil para detectar palavrões em qualquer outro canal em que o bot não esteja: S/N

source: Enter usernames to be jailed (comma-separated, leave blank to disable):
ar: أدخل أسماء المستخدمين التي تريد سجنها (مفصولة بفواصل، اتركها فارغة لتعطيلها):
pt: Insira os nomes de usuário a serem presos (separados por vírgula, deixe em branco para desativar):

source: Enter the jail channel path:
ar: أدخل مسار قناة السجن:

source: Using the default jail channel: /jail/
ar: استخدام قناة السجن الافتراضية: /jail/
pt: Usando o canal de prisão padrão: /jail/

source: Please enter a jail timeout between each attempt if the user trys to joins another channel: this timeout will start, and start counting every time the user joins another channel.
ar: يرجى إدخال مهلة زمنية بين كل محاولة إذا حاول المستخدم الانضمام إلى قناة أخرى: ستبدأ مهلة الوقت هذه، وستبدأ في العد في كل مرة ينضم فيها المستخدم إلى قناة أخرى.
pt: Por favor, insira um tempo limite de prisão entre cada tentativa se o usuário tentar entrar em outro canal: esse tempo limite começará e começará a contar toda vez que o usuário entrar em outro canal.

source: the jail flood count means how many counts within the specified timeout to ban and kick the user. For example: if the jail timeout is 10, and jail flood count is 5: it means that when the jailed user trys to joins another channel: the bot will move them back, and starts a timer for 10 seconds, within this timer: if the user attempts to leave the jail channel more than 5 times: they will be banned and kicked.
ar: يعني عدد مرات دخول السجن عدد المرات التي يتم فيها حظر المستخدم وطرده خلال المهلة المحددة. على سبيل المثال: إذا كانت مهلة السجن 10، وكان عدد مرات دخول السجن 5: فهذا يعني أنه عندما يحاول المستخدم المسجون الانضمام إلى قناة أخرى: سيعيده الروبوت إلى الوراء، ويبدأ مؤقتًا لمدة 10 ثوانٍ، خلال هذا المؤقت: إذا حاول المستخدم مغادرة قناة السجن أكثر من 5 مرات: فسيتم حظره وطرده.
pt: a contagem de tentativas de prisão significa quantas contagens dentro do tempo limite especificado para banir e expulsar o usuário. Por exemplo: se o tempo limite da prisão for 10 e a contagem de tentativas da prisão for 5: significa que quando o usuário preso tentar entrar em outro canal: o bot irá movê-lo de volta e iniciará um cronômetro de 10 segundos, dentro deste cronômetro: se o usuário tentar sair do canal de prisão mais de 5 vezes: será banido e expulso.

source: Specify the jail timeout in seconds (leave blank for default 10):
ar: حدد مهلة السجن بالثواني (اتركها فارغة للقيمة الافتراضية 10):
pt: Especifique o tempo limite de prisão em segundos (deixe em branco para o padrão 10):

source: Error: Please enter a valid number.
ar: خطأ: الرجاء إدخال رقم صالح.
pt: Erro: Por favor insira um número válido.

source: Using the default value 10
ar: استخدام القيمة الافتراضية 10
pt: Usando o valor padrão 10

source: Specify the join count threshold (leave blank for default 5):
ar: حدد عتبة عدد الانضمامات (اتركها فارغة للقيمة الافتراضية 5):
pt: Especifique o limite de contagem de junções (deixe em branco para o padrão 5):

source: Using the default value 5
ar: استخدام القيمة الافتراضية 5
pt: Usando o valor padrão 5

source: Optionally: Please input jailed nicknames, this is different from jailed users, because this relys on nicknames, while the other option relys on usernames:
ar: اختياريًا: يرجى إدخال الألقاب المسجونة، وهذا يختلف عن المستخدمين المسجونين، لأن هذا يعتمد على الألقاب، بينما يعتمد الخيار الآخر على أسماء المستخدمين:
pt: Opcionalmente: insira apelidos presos, isso é diferente de usuários presos, porque depende de apelidos, enquanto a outra opção depende de nomes de usuário:

source: Please note that the following 2 features are optional, the character limit is to prevent long nicknames, if you want to disable it: enter 0 when asked.
ar: يرجى ملاحظة أن الميزتين التاليتين اختياريتان، والحد الأقصى للأحرف هو لمنع الألقاب الطويلة، إذا كنت تريد تعطيله: أدخل 0 عند السؤال.
pt: Observe que os 2 recursos a seguir são opcionais, o limite de caracteres é para evitar apelidos longos, se você quiser desativá-lo: digite 0 quando solicitado.

source: Specify the interval between sending messages, Leave blank to disable:
ar: حدد الفاصل الزمني بين إرسال الرسائل، واتركه فارغًا لتعطيله:
pt: Especifique o intervalo entre o envio de mensagens, deixe em branco para desabilitar:

source: Specify how long the name to kick if the name is longer than this limit, Enter 0 to disable:
ar: حدد مدة الاسم الذي تريد إيقافه إذا كان الاسم أطول من هذا الحد، أدخل 0 لتعطيله:
pt: Especifique por quanto tempo o nome será chutado se o nome for maior que esse limite. Digite 0 para desabilitar:

source: Error: Only numbers are allowed here
ar: خطأ: يُسمح هنا بالأرقام فقط
pt: Erro: Somente números são permitidos aqui

source: Please specify the action when the nickname is longer than the specified char limit:
ar: يرجى تحديد الإجراء عندما يكون الاسم المستعار أطول من حد الأحرف المحدد:
pt: Especifique a ação quando o apelido for maior que o limite de caracteres especificado:

source: 1: Kick the user
ar: 1: طرد المستخدم
pt: 1: Chute o usuário

source: 2: Ban the user
ar: 2: حظر المستخدم
pt: 2: Banir o usuário

source: Error, Only numbers are allowed here
ar: خطأ، يُسمح هنا بالأرقام فقط
pt: Erro, apenas números são permitidos aqui

source: Choose the action when a black listed nickname is in the blacklist file
ar: اختر الإجراء عندما يكون اسم مستعار مدرج في القائمة السوداء موجودًا في ملف القائمة السوداء
pt: Escolha a ação quando um apelido da lista negra estiver no arquivo da lista negra

source: Invalid choice, Only numbers are allowed here
ar: اختيار غير صالح، يُسمح هنا بالأرقام فقط
pt: Escolha inválida. Somente números são permitidos aqui

source: Please specify the timer before deleting a youtube video, In minutes. Set to 0 to disable automatic video deletion after upload:
ar: يرجى تحديد المؤقت قبل حذف مقطع فيديو على YouTube، بالدقائق. اضبطه على 0 لتعطيل الحذف التلقائي للفيديو بعد التحميل:
pt: Especifique o cronômetro antes de excluir um vídeo do YouTube, em minutos. Defina como 0 para desativar a exclusão automática de vídeo após o upload:

source: Defaulting to 15 minutes.
ar: الإفتراضي هو 15 دقيقة.
pt: O padrão é 15 minutos.

source: Enter the list of disallowed countries. Separated with commas:
ar: أدخل قائمة البلدان المحظورة. مفصولة بفواصل:
pt: Insira a lista de países não permitidos. Separados por vírgulas:

source: Audio Device Selection:
ar: اختيار جهاز الصوت:
pt: Seleção de dispositivo de áudio:

source: Available Input Devices:
ar: أجهزة الإدخال المتوفرة:
pt: Dispositivos de entrada disponíveis:

source: Choose Input Device Number:
ar: اختر رقم جهاز الإدخال:
pt: Escolha o número do dispositivo de entrada:
