Repository: alano332/tt_utilities
Catalog: locales/*/LC_MESSAGES/messages.po
Languages: ar, pt

source: Initializing audio devices...
ar: جاري تهيئة أجهزة الصوت...
pt: Inicializando dispositivos de áudio...

source: Audio devices Initialized.
ar: تم تهيئة الأجهزة الصوتية.
pt: Dispositivos de áudio inicializados.

source: Error while initializing audio devices: {e}
ar: خطأ أثناء تهيئة أجهزة الصوت: {e}
pt: * Erro ao inicializar dispositivos de áudio: {e}

source: Error, Please check your config file and try again, or recreate your config file by deleting existing file and then run the bot
ar: خطأ، يرجى التحقق من ملف التكوين الخاص بك والمحاولة مرة أخرى، أو إعادة إنشاء ملف التكوين الخاص بك عن طريق حذف الملف الموجود ثم تشغيل الروبوت
pt: Erro, verifique seu arquivo de configuração e tente novamente ou recrie seu arquivo de configuração excluindo o arquivo existente e execute o bot

source: Press Enter to quit...
ar: اضغط على Enter للخروج...
pt: Pressione Enter para sair...

source: A new version has been detected: {server_version}
ar: تم اكتشاف إصدار جديد: {server_version}
pt: * Uma nova versão foi detectada: {server_version}

source: Update downloaded and extracted successfully!
ar: تم تنزيل التحديث واستخراجه بنجاح!
pt: Atualização baixada e extraída com sucesso!

source: Press Enter to quit.
ar: اضغط على Enter للخروج.
pt: Pressione Enter para sair.

source: No updates found.
ar: لم يتم العثور على تحديثات.
pt: Nenhuma atualização encontrada.

source: Failed to check for updates
ar: فشل في التحقق من التحديثات
pt: Falha ao verificar atualizações

source: Connected successfully!
ar: تم الاتصال بنجاح!
pt: Conectado com sucesso!

source: Could not connect to server {server_address} port={port}
ar: تعذر الاتصال بالخادم {server_address} port={port}

source: Trying to reconnect.
ar: محاولة إعادة الاتصال.
pt: Tentando se reconectar.

source: Connection lost. Trying to reconnect...
ar: تم فقد الاتصال. جاري محاولة إعادة الاتصال...
pt: Conexão perdida. Tentando reconectar...

source: Logged in successfully
ar: تم تسجيل الدخول بنجاح
pt: Conectado com sucesso

source: I've been kicked from the channel. Reconnecting in 5 seconds...
ar: لقد تم طردي من القناة. سأعاود الاتصال خلال 5 ثوانٍ...
pt: Fui expulso do canal. Reconectando em 5 segundos...

source: Hey! Why did you kick me?
ar: مهلا! لماذا ركلتني؟
pt: Ei! Por que você me chutou?

source: intercepting channel messages for user {user}
ar: اعتراض رسائل القناة للمستخدم {user}

source: subscribed to user messages
ar: مشترك في رسائل المستخدم
pt: subscrevendo as mensagens do usuário

source: Subscribed to channel messages
ar: اشتركت في رسائل القناة
pt: * subscrevendo as mensagens do canal

source: /rate
ar: /معدل
pt: /taxa

source: Rate set to {rate}.
ar: تم ضبط المعدل إلى {rate}.

source: Invalid rate value. Rate should be between -100 and 100.
ar: قيمة معدل غير صالحة. يجب أن يكون المعدل بين -100 و100.
pt: Valor de taxa inválido. A taxa deve estar entre -100 e 100.

source: Invalid command. Usage: /rate <rate_value>.
ar: أمر غير صالح. الاستخدام: /rate <rate_value>.
pt: Comando inválido. Uso: /taxa <valor_taxa>.

source: /pitch
ar: /يقذف
pt: /tom

source: Pitch set to {pitch}.
ar: تم ضبط درجة الصوت على {pitch}.

source: Invalid pitch value. Pitch should be between -100 and 100.
ar: قيمة الملعب غير صالحة. يجب أن تكون درجة الملعب بين -100 و100.
pt: Valor de pitch inválido. O tom deve estar entre -100 e 100.

source: Invalid command. Usage: /pitch <pitch_value>
ar: أمر غير صالح. الاستخدام: /pitch <pitch_value>
pt: Comando inválido. Uso: /pitch <pitch_value>

source: /volume
ar: /مقدار

source: Volume set to {volume}.
ar: تم ضبط مستوى الصوت على {volume}.

source: Invalid volume value. Volume should be between 0.1 and 1.0.
ar: قيمة حجم غير صالحة. يجب أن يكون الحجم بين 0.1 و1.0.
pt: Valor de volume inválido. O volume deve estar entre 0,1 e 1,0.

source: Invalid command. Usage: /volume <volume_value>
ar: أمر غير صالح. الاستخدام: /volume <volume_value>
pt: Comando inválido. Uso: /volume <volume_value>

source: /voice
ar: /صوت
pt: /voz

source: Voice set to {voice_name}.
ar: تم ضبط الصوت إلى {voice_name}.
pt: Voz definida como {voice_name}.

source: Invalid command. Usage: /voice <voice_name>.
ar: أمر غير صالح. الاستخدام: /voice <voice_name>.
pt: Comando inválido. Uso: /voice <nome_da_voz>.

source: /s
ar: /ث
pt: /pr

source: Sorry, You are not in the same channel
ar: عذرا، أنت لست في نفس القناة
pt: Desculpe, você não está no mesmo canal

source: Hello. Important: The user {name} has logged in to the server.
ar: مرحبًا. هام: قام المستخدم {name} بتسجيل الدخول إلى الخادم.

source: Hello there. Important: The user {username} has logged in to the server.
ar: مرحبًا بك. هام: قام المستخدم {username} بتسجيل الدخول إلى الخادم.
pt: Olá. Importante: O usuário {username} efetuou login no servidor.

source: You have a message from {username} ({nickname}): {message}
ar: لديك رسالة من {username} ({nickname}): {message}

source: User {nickname} is excluded, skipping action.
ar: تم استبعاد المستخدم {nickname} وتخطي الإجراء.
pt: O usuário {nickname} foi excluído, ignorando a ação.

source: Duration ban (IP) activated for {nickname}
ar: تم تفعيل حظر المدة (IP) لـ {nickname}

source: Duration ban (Username) activated for {nickname}
ar: تم تفعيل حظر المدة (اسم المستخدم) لـ {nickname}

source: {nickname} has been banned for using a VPN.
ar: تم حظر {nickname} لاستخدام VPN.

source: {nickname} has been kicked due to username exceeding {chars} characters.
ar: تم طرد {nickname} بسبب تجاوز اسم المستخدم {chars} حرفًا.

source: You have been kicked due to username exceeding {chars} characters.
ar: لقد تم طردك بسبب أن اسم المستخدم يتجاوز {chars} حرفًا.

source: Hey {nickname}, This is not the place for you and your country {country}. Go away.
ar: يا {اسم مستعار}، هذا ليس المكان المناسب لك ولبلدك {بلدك}. ارحل.

source: Welcome, {nickname)} from {country}!
ar: مرحبًا بك {الاسم المستعار)} من {country}!

source: Ahoy there, {nickname} from {country}! Welcome aboard!
ar: أهلاً بك، {الاسم المستعار} من {البلد}! مرحبًا بك على متن الطائرة!

source: Greetings, {nickname)} of {country}! We're glad to have you here.
ar: تحياتي، {الاسم المستعار} من {البلد}! نحن سعداء بوجودك هنا.

source: Howdy, {nickname}! Welcome from {country}.
ar: مرحباً بك، {الاسم المستعار}! أهلاً بك من {country}.

source: Whoa! {nickname} just arrived from {country}! Let's party!
ar: واو! لقد وصل {الاسم المستعار} للتو من {البلد}! فلنحتفل!

source: Look who's here! {nickname} from {country} just logged in!
ar: انظر من هنا! {nickname} من {country} قام للتو بتسجيل الدخول!

source: Good vibes only for {nickname} from {country}! Welcome, my friend!
ar: أجواء طيبة فقط لـ {nickname} من {country}! مرحبًا بك يا صديقي!

source: Surprise, surprise! It's {nickname} from {country}! Glad to have you!
ar: مفاجأة، مفاجأة! أنا {اسم مستعار} من {country}! سعيد بوجودك!

source: Let the fun begin! Welcome, {nickname} from the land of {country}!
ar: لتبدأ المتعة! مرحبًا بك {اسم مستعار} من أرض {country}!

source: cannot identify the country name for that IP address likely due to an invalid IP address: {ip_address}
ar: لا يمكن تحديد اسم الدولة لعنوان IP هذا، ربما بسبب عنوان IP غير صالح: {ip_address}

source: {nickname} has joined the server
ar: انضم {nickname} إلى الخادم

source: Error sending Telegram notification: {e}
ar: حدث خطأ أثناء إرسال إشعار Telegram: {e}
pt: Erro ao enviar notificação do Telegram: {e}

source: Warning: You are trying to get out of the jail for more than 3 times, If you continue to spam: You'll be banned, I repeat: Do not spam
ar: تحذير: أنت تحاول الخروج من السجن أكثر من 3 مرات، إذا واصلت إرسال رسائل غير مرغوب فيها: سيتم حظرك، أكرر: لا ترسل رسائل غير مرغوب فيها
pt: Aviso: Você está tentando sair da prisão mais de 3 vezes, Se continuar enviando spam: Você será banido, repito: Não envie spam

source: {nickname} has been banned due to jail flood protection.
ar: تم حظر {nickname} بسبب حماية السجن من الفيضانات.

source: Message received: {message} from {username}
ar: الرسالة المستلمة: {message} من {username}

source: /weather
ar: /طقس
pt: /clima

source: User '{user}' not found.
ar: لم يتم العثور على المستخدم '{user}'.

source: Could not retrieve location information.
ar: لم يتمكن من استرجاع معلومات الموقع.
pt: Não foi possível recuperar informações de localização.

source: /search
ar: /يبحث
pt: /procurar

source: Wikipedia link: {page_url}
ar: رابط ويكيبيديا: {page_url}
pt: Link da Wikipédia: {page_url}

source: Page not found on Wikipedia.
ar: لم يتم العثور على الصفحة على ويكيبيديا.
pt: Página não encontrada na Wikipedia.

source: Multiple pages found for '{query}'. Please be more specific.
ar: تم العثور على صفحات متعددة لـ '{query}'. يرجى تحديد المزيد من التفاصيل.
pt: Várias páginas encontradas para '{query}'. Por favor, seja mais específico.

source: /file
ar: /ملف
pt: /arquivo

source: Wikipedia page for '{query}' uploaded as {filename}
ar: تم تحميل صفحة ويكيبيديا الخاصة بـ '{query}' باسم {filename}
pt: Página da Wikipedia para '{query}' enviada como {filename}

source: /reboot
ar: /إعادة التشغيل
pt: /reinício

source: /exec
ar: /تنفيذي
pt: /execute

source: /db
ar: /ديسيبل

source: /dk
ar: /دك

source: /b
ar: /ب

source: /clear
ar: /واضح
pt: /limpar

source: /clear
ar: /واضح
pt: /limpar

source: /jail
ar: /سجن
pt: /cadeia

source: /unjail
ar: /إطلاق سراحه
pt: /desaprisionar

source: /cn
ar: /سي إن

source: /save
ar: /يحفظ
pt: /salvar

source: /jails
ar: /السجون
pt: /prisões

source: /cs
ar: /سي إس

source: /cg
ar: /سي جي

source: /new
ar: /جديد
pt: /novo

source: /ld
ar: /لد

source: Language detection is now OFF.
ar: تم إيقاف اكتشاف اللغة الآن.
pt: A detecção de idioma agora está DESLIGADA.

source: Language detection is now ON.
ar: تم الآن تشغيل اكتشاف اللغة.
pt: A detecção de idioma agora está ATIVADA.

source: /say
ar: /يقول

source: Please provide some text to speak.
ar: يرجى تقديم بعض النصوص للتحدث.
pt: Por favor, forneça algum texto para falar.

source: /get_voices
ar: /الحصول على الأصوات
pt: /obter_vozes

source: /who
ar: /من

source: /whoall
ar: /جميعاً

source: /dl
ar: /دل

source: Download already in progress. Please wait.
ar: جاري التحميل بالفعل. يرجى الانتظار.
pt: Download já em andamento. Por favor, aguarde.

source: /notify
ar: /إخطار
pt: /notificar

source: /unotify
ar: /عدم الإخطار
pt: /desnotificar

source: /pm
ar: /مساءً

source: /messages
ar: /رسائل
pt: /mensagens

source: /users
ar: /المستخدمين
pt: /Usuários

source: /u
ar: /و

source: /p
ar: /ص

source: /p
ar: /ص

source: /n
ar: /ن

source: /b
ar: /ب

source: /v
ar: /ف

source: /gl
ar: /جل

source: /myinfo
ar: /معلوماتي
pt: /minhas_informações

source: /d
ar: /د

source: /r
ar: /ر

source: /r
ar: /ر

source: /help
ar: /يساعد
pt: /ajuda

source: Available Commands:
ar: الأوامر المتوفرة:
pt: Comandos disponíveis:

source: Invalid command. Send /help to get the list of commands.
ar: أمر غير صالح. أرسل /help للحصول على قائمة الأوامر.
pt: Comando inválido. Envie /ajuda para obter a lista de comandos.

source: /t
ar: /ت

source: Auto-translate is now OFF.
ar: تم إيقاف الترجمة التلقائية الآن.
pt: A tradução automática agora está DESATIVADA.

source: Auto-translate is now ON: {source_lang} -> {target_lang}
ar: الترجمة التلقائية أصبحت الآن قيد التشغيل: {source_lang} -> {target_lang}
pt: A tradução automática agora está ATIVADA: {source_lang} -> {target_lang}

source: Invalid command. Usage: /t [source_lang] [target_lang]
ar: أمر غير صالح. الاستخدام: /t [source_lang] [target_lang]
pt: Comando inválido. Uso: /t [source_lang] [target_lang]

source: Please wait 10 seconds before using /t command again.
ar: يرجى الانتظار لمدة 10 ثواني قبل استخدام الأمر /t مرة أخرى.
pt: Aguarde 10 segundos antes de usar o comando /t novamente.

source: /pt
ar: /نقطة

source: Private translate mode disabled.
ar: تم تعطيل وضع الترجمة الخاصة.
pt: Modo de tradução privada desativado.

source: Private translate mode is not active.
ar: وضع الترجمة الخاص ليس نشطًا.
pt: O modo de tradução privada não está ativo.

source: /pt
ar: /نقطة

source: Private translate mode enabled: {source_lang} -> {target_lang}
ar: تم تمكين وضع الترجمة الخاصة: {source_lang} -> {target_lang}
pt: Modo de tradução privada ativado: {source_lang} -> {target_lang}

source: Invalid command. Usage: /pt [source_lang] [target_lang]
ar: أمر غير صالح. الاستخدام: /pt [source_lang] [target_lang]
pt: Comando inválido. Uso: /pt [source_lang] [target_lang]

source: Error, this mode can only be enabled if the bot and the user are in the same channel
ar: خطأ، لا يمكن تمكين هذا الوضع إلا إذا كان الروبوت والمستخدم في نفس القناة
pt: Erro, este modo só pode ser habilitado se o bot e o usuário estiverem no mesmo canal

source: {nickname)} says: {translated}
ar: يقول {الاسم المستعار}: {مترجم}

source: Error: Language not supported ({e})
ar: خطأ: اللغة غير مدعومة ({e})
pt: Erro: idioma não suportado ({e})

source: Using voice {voice_name} for {detected_lang}
ar: استخدام الصوت {voice_name} لـ {detected_lang}

source: The detected language ({detected_lang}) is not available in MSSpeech, using gTTS.
ar: اللغة المكتشفة ({detected_lang}) غير متوفرة في MSSpeech، باستخدام gTTS.
pt: O idioma detectado ({detected_lang}) não está disponível no MSSpeech, usando gTTS.

source: Language detection failed. Using default voice.
ar: فشل اكتشاف اللغة. استخدام الصوت الافتراضي.
pt: Falha na detecção de idioma. Usando voz padrão.

source: Error: {e}
ar: خطأ: {e}

source: /get_voices
ar: /الحصول على الأصوات
pt: /obter_vozes

source: Name: {voice_name}, ShortName: {short_name}, Locale: {locale}
ar: الاسم: {voice_name}، الاسم المختصر: {short_name}، الموقع: {locale}

source: Error: {error}
ar: خطأ: {خطأ}
pt: Erro: {error}

source: Output: {output}
ar: الإخراج: {الإخراج}
pt: Saída: {output}

source: SSH connection error: {e}
ar: خطأ اتصال SSH: {e}
pt: Erro de conexão SSH: {e}

source: Error getting location: {message} for IP: {ip_address}
ar: خطأ في الحصول على الموقع: {message} لعنوان IP: {ip_address}

source: Error getting location: {e} for IP: {ip_address}
ar: خطأ في الحصول على الموقع: {e} لعنوان IP: {ip_address}
pt: Erro ao obter localização: {e} for IP: {ip_address}

source: The current weather in {city}, {country_name} is {temperature}\u00B0C, {condition}. The perceived temperature is {feels_like} degrees C, the wind speed is at {wind_speed} kilometers per hour, The wind gusts are at {gust_kph} kilometers per hour, The windchill is {windchill_c}\u00B0C. The Precipitation is {precip_mm} MM, The cloudiness is of {cloudiness}%, With a {chance_of_rain}% chance of rain. The visibility is up to {visibility} kilometers. The humidity is {humidity}%, The current time is {time}.
ar: الطقس الحالي في {city}, {country_name} هو {temperature}\u00B0C, {condition}. درجة الحرارة المدركة هي {feels_like} درجة مئوية، وسرعة الرياح هي {wind_speed} كيلومتر في الساعة، وهبات الرياح هي {gust_kph} كيلومتر في الساعة، ودرجة برودة الرياح هي {windchill_c}\u00B0C. هطول الأمطار هو {precip_mm} ملم، والغيوم هي {cloudiness}%، مع فرصة هطول أمطار هي {chance_of_rain}%. الرؤية تصل إلى {visibility} كيلومتر. الرطوبة هي {humidity}%، الوقت الحالي هو {time}.

source: Error fetching weather data: {e}
ar: خطأ في جلب بيانات الطقس: {e}
pt: Erro ao buscar dados meteorológicos: {e}

source: KeyError in get_weather: {e}. Check API response:
ar: KeyError في get_weather: {e}. تحقق من استجابة واجهة برمجة التطبيقات:
pt: KeyError em get_weather: {e}. Verifique a resposta da API:

source: Error: Invalid data received from weather API.
ar: خطأ: تم استلام بيانات غير صالحة من واجهة برمجة تطبيقات الطقس.
pt: Erro: dados inválidos recebidos da API meteorológica.

source: Please provide a username.
ar: يرجى تقديم اسم المستخدم.
pt: Forneça um nome de usuário.

source: Invalid command. Usage: /private <second_name>
ar: أمر غير صالح. الاستخدام: /private <second_name>
pt: Comando inválido. Uso: /private <second_name>

source: Either you or {second_name} is already in a private channel.
ar: إما أنك أو {second_name} موجود بالفعل في قناة خاصة.
pt: Você ou {second_name} já estão em um canal privado.

source: User {second_name} not found.
ar: لم يتم العثور على المستخدم {second_name}.
pt: Usuário {second_name} não encontrado.

source: Password for the private channel: {password}
ar: كلمة المرور للقناة الخاصة: {password}
pt: Senha do canal privado: {password}

source: Cannot identify country and city for user ID: {current_user_id}
ar: لا يمكن تحديد البلد والمدينة لمعرف المستخدم: {current_user_id}
pt: Não é possível identificar o país e a cidade para o ID do usuário: {current_user_id}

source: You are the only one from {country}.
ar: أنت الوحيد من {country}.

source: There are {count} users from {country}.
ar: هناك {count} مستخدم من {country}.

source: Sorry, your country information is not available.
ar: عذراً، معلومات بلدك غير متوفرة.
pt: Lamentamos, mas as informações do seu país não estão disponíveis.

source: Currently:
ar: حالياً:
pt: Atualmente:

source: There are {count} users from {country},
ar: هناك {count} مستخدم من {country}،
pt: Existem {count} usuários de {country},

source: No country information available for users.
ar: لا تتوفر معلومات عن البلد للمستخدمين.
pt: Nenhuma informação de país disponível para os usuários.

source: You are not in the same channel
ar: أنت لست في نفس القناة
pt: Você não está no mesmo canal

source: Downloading: {title}
ar: جاري التحميل: {title}

source: Invalid command. Usage: /dl <youtube_link>
ar: أمر غير صالح. الاستخدام: /dl <youtube_link>
pt: Comando inválido. Uso: /dl<youtube_link>

source: Downloading audio. Please wait...
ar: جاري تحميل الصوت. الرجاء الانتظار...
pt: Baixando áudio. Por favor, aguarde...

source: File {filename} downloaded successfully. Uploading to the server...
ar: تم تنزيل الملف {filename} بنجاح. جاري التحميل إلى الخادم...

source: Error downloading or uploading: {e}
ar: خطأ في التنزيل أو التحميل: {e}

source: Error deleting file: {e}
ar: خطأ في حذف الملف: {e}

source: {nickname} requested playing from a URL
ar: طلب {nickname} اللعب من عنوان URL

source: Playing: {title}
ar: اللعب: {العنوان}

source: Invalid command. Usage: /u <link>
ar: أمر غير صالح. الاستخدام: /u <link>
pt: Comando inválido. Uso: /u <link>

source: The bot is already playing something. Please stop the playback before attempting to play something else
ar: يقوم الروبوت بتشغيل شيء ما بالفعل. يرجى إيقاف التشغيل قبل محاولة تشغيل شيء آخر
pt: O bot já está tocando alguma coisa. Pare a reprodução antes de tentar reproduzir outra coisa

source: Searching
ar: البحث
pt: Procurando

source: {nickname} requested to play: {title}
ar: طلب {nickname} اللعب: {title}

source: No results found for '{query}'.
ar: لم يتم العثور على نتائج لـ '{query}'.
pt: Nenhum resultado encontrado para '{query}'.

source: Invalid command. Usage: /p <search_query>
ar: أمر غير صالح. الاستخدام: /p <search_query>
pt: Comando inválido. Uso: /p <search_query>

source: Playing: {next_video_title}
ar: جاري التشغيل: {next_video_title}
pt: Reproduzindo: {next_video_title}

source: You've reached the end of the search results.
ar: لقد وصلت إلى نهاية نتائج البحث.
pt: Você chegou ao final dos resultados da pesquisa.

source: Nothing is currently playing.
ar: لا يتم تشغيل أي شيء حاليًا.
pt: Nada está sendo reproduzido no momento.

source: You are at the beginning of the search results.
ar: أنت في بداية نتائج البحث.
pt: Você está no início dos resultados da pesquisa.

source: {nickname} stopped the playback
ar: أوقف {nickname} التشغيل

source: Nothing is currently playing
ar: لا يوجد شيء يلعب حاليا
pt: Nada está sendo reproduzido no momento

source: Maximum allowed volume is {max_volume}
ar: الحد الأقصى المسموح به للحجم هو {max_volume}

source: {name} has changed the volume to {volume}
ar: لقد قام {name} بتغيير مستوى الصوت إلى {volume}
pt: {name} alterou o volume para {volume}

source: This is already the set volume
ar: هذا هو بالفعل حجم المجموعة
pt: Este já é o volume definido

source: The current volume is {volume}
ar: الحجم الحالي هو {volume}

source: Sorry. Trying to pause nothing: But failed.
ar: معذرة. أحاول إيقاف أي شيء مؤقتًا: ولكنني فشلت.
pt: Desculpe. Tentando pausar nada: Mas falhou.

source: {nickname} paused the playback
ar: أوقف {nickname} التشغيل مؤقتًا

source: Paused: {title}
ar: متوقف مؤقتًا: {العنوان}

source: Total duration: {total_duration}. Elapsed time: {elapsed_time}. Remaining time: {remaining_time}
ar: المدة الإجمالية: {total_duration}. الوقت المنقضي: {elapsed_time}. الوقت المتبقي: {remaining_time}

source: {nickname} requested to play {title} from history
ar: طلب {nickname} تشغيل {title} من التاريخ

source: Invalid command. Usage: /r <index>
ar: أمر غير صالح. الاستخدام: /r <index>
pt: Comando inválido. Uso: /r <índice>

source: Alright. You will be notified when {name} logs in to the server.
ar: حسنًا، سيتم إعلامك عندما يقوم {name} بتسجيل الدخول إلى الخادم.

source: Invalid command. Usage: /notify <nickname> <telegram_chat_id>
ar: أمر غير صالح. الاستخدام: /notify <nickname> <telegram_chat_id>
pt: Comando inválido. Uso: /notify <apelido> <telegram_chat_id>

source: Alright. You will be notified when {username} joins the server.
ar: حسنًا، سيتم إعلامك عند انضمام {username} إلى الخادم.
pt: Tudo bem. Você será notificado quando {username} entrar no servidor.

source: Invalid command. Usage: /unotify <username> <telegram_chat_id>
ar: أمر غير صالح. الاستخدام: /unotify <اسم المستخدم> <معرف دردشة التلجرام>
pt: Comando inválido. Uso: /unotify <nomedeusuário> <telegram_chat_id>

source: You already have a pending message for {target_username}.
ar: لديك بالفعل رسالة معلقة لـ {target_username}.
pt: Você já tem uma mensagem pendente para {target_username}.

source: Your message for {target_username} has been saved. It will be delivered when they log in.
ar: لقد تم حفظ رسالتك لـ {target_username}. سيتم تسليمها عند تسجيل الدخول.
pt: Sua mensagem para {target_username} foi salva. Ele será entregue quando eles fizerem login.

source: Invalid command. Usage: /pm <username> <message>
ar: أمر غير صالح. الاستخدام: /pm <اسم المستخدم> <الرسالة>
pt: Comando inválido. Uso: /pm <nome de usuário> <mensagem>

source: Pending message. to: {username} ({nickname}): {message}
ar: رسالة معلقة. إلى: {اسم المستخدم} ({الاسم المستعار}): {الرسالة}

source: Pending message. to: {username} ({nickname}): {message}
ar: رسالة معلقة. إلى: {اسم المستخدم} ({الاسم المستعار}): {الرسالة}

source: You have no pending messages.
ar: ليس لديك رسائل معلقة.
pt: Você não tem mensagens pendentes.

source: Cannot identify country and city for user ID: {user_id}
ar: لا يمكن تحديد البلد والمدينة لمعرف المستخدم: {user_id}
pt: Não é possível identificar o país e a cidade para o ID do usuário: {user_id}

source: Invalid command format. Usage: /new <username> <password> <rights>
ar: تنسيق الأمر غير صالح. الاستخدام: /new <username> <password> <rights>
pt: Formato de comando inválido. Uso: /new <username> <password> <rights>

source: Invalid command format. Usage: /new <username> <password> [<rights>]
ar: تنسيق الأمر غير صالح. الاستخدام: /new <username> <password> [<rights>]
pt: Formato de comando inválido. Uso: /new <username> <password> <rights>

source: Account '{username}' created successfully.
ar: تم إنشاء الحساب '{username}' بنجاح.
pt: Conta '{username}' criada com sucesso.

source: User Info: Nickname: {nickname} Username: {username} Password: {password} IP Address: {ip_address} Status Message: {status_message}
ar: معلومات المستخدم: الاسم المستعار: {nickname} اسم المستخدم: {username} كلمة المرور: {password} عنوان IP: {ip_address} رسالة الحالة: {status_message}

source: Attention, The server is rebooting...
ar: انتبه، يتم إعادة تشغيل الخادم...
pt: Atenção, o servidor está reiniciando...

source: Not authorized
ar: غير مصرح به
pt: Não autorizado

source: /jail
ar: /سجن
pt: /cadeia

source: /unjail
ar: /إطلاق سراحه
pt: /desaprisionar

source: /cn
ar: /سي إن

source: /cs
ar: /سي إس

source: /cg
ar: /سي جي

source: {nickname} has been kicked for {duration_}.
ar: تم طرد {nickname} لمدة {duration_}.

source: User '{nickname}' not found.
ar: لم يتم العثور على المستخدم '{nickname}'.
pt: Usuário '{nickname}' não encontrado.
