Repository: alano332/tt_utilities
Catalog: locales/*/LC_MESSAGES/messages.po
Languages: ar, pt

source: Invalid choice. Please enter a valid number from the list.
ar: اختيار غير صالح. الرجاء إدخال رقم صالح من القائمة.
pt: Escolha inválida. Insira um número válido da lista.

source: Invalid input. Please enter a number.
ar: إدخال غير صالح. الرجاء إدخال رقم.
pt: Entrada inválida. Insira um número.

source: Available Output Devices:
ar: أجهزة الإخراج المتوفرة:
pt: Dispositivos de saída disponíveis:

source: Choose Output Device Number:
ar: اختر رقم جهاز الإخراج:
pt: Escolha o número do dispositivo de saída:

source: Seek step, in seconds. Default is 5:
ar: ابحث عن الخطوة بالثواني. الافتراضي هو 5:
pt: Tempo para avançar/retroceder a música (em segundos)

source: Default volume:
ar: الحجم الافتراضي:
pt: Volume padrão:

source: Max volume: Default is 100:
ar: الحد الأقصى للحجم: الافتراضي هو 100:
pt: Volume máximo: O padrão é 100:

source: The following section is completely optional. If you want to enable other features of the bot: Please fill the required info below:
ar: القسم التالي اختياري تمامًا. إذا كنت تريد تمكين ميزات أخرى للبوت: يرجى ملء المعلومات المطلوبة أدناه:
pt: A seção a seguir é totalmente opcional. Se você deseja ativar outros recursos do bot: Preencha as informações necessárias abaixo:

source: Please enter a telegram bot token. This is optional:
ar: الرجاء إدخال رمز بوت التليجرام. هذا اختياري:
pt: Insira um token de bot de telegrama. Isto é opcional:

source: Enter your weather API key, Please read the readme file for more info on how to get one:
ar: أدخل مفتاح API الخاص بالطقس، يرجى قراءة ملف readme للحصول على مزيد من المعلومات حول كيفية الحصول عليه:
pt: Insira sua chave de API meteorológica. Leia o arquivo leia-me para obter mais informações sobre como obter uma:

source: SSH info, Note: this section is made because in case you want to interact with your SSH server from your bot, and you may skip it if you don't have a server, read the readme file for more info
ar: معلومات SSH، ملاحظة: تم إنشاء هذا القسم لأنه في حالة رغبتك في التفاعل مع خادم SSH من خلال الروبوت الخاص بك، ويمكنك تخطيه إذا لم يكن لديك خادم، اقرأ ملف readme للحصول على مزيد من المعلومات
pt: Informações SSH, Nota: esta seção é feita porque caso você queira interagir com seu servidor SSH a partir do seu bot, e você pode ignorá-lo se não tiver um servidor, leia o arquivo leia-me para mais informações

source: We do not collect such info or share it, because the bot is completely controled by you and no one else, the bot is not connected to any servers to track users or bans them from accessing the bot, Just a reminder in case you're worried about your server info
ar: نحن لا نجمع مثل هذه المعلومات أو نشاركها، لأن الروبوت يتم التحكم فيه بالكامل من قبلك ولا أحد غيرك، الروبوت غير متصل بأي خوادم لتتبع المستخدمين أو منعهم من الوصول إلى الروبوت، مجرد تذكير في حالة قلقك بشأن معلومات الخادم الخاص بك
pt: Não coletamos essas informações nem as compartilhamos, porque o bot é totalmente controlado por você e por mais ninguém, o bot não está conectado a nenhum servidor para rastrear usuários ou proibi-los de acessar o bot. Apenas um lembrete caso você esteja preocupado com as informações do seu servidor

source: Enter SSH hostname:
ar: أدخل اسم مضيف SSH:
pt: endereço do Seu servidor SSH

source: Enter SSH port:
ar: أدخل منفذ SSH:
pt: Porta do seu Servidor SSH

source: Enter SSH username:
ar: أدخل اسم مستخدم SSH:
pt: Nome de usuário SSH do seu Servidor

source: Enter SSH password:
ar: أدخل كلمة مرور SSH:
pt: Senha SSH do seu Servidor

source: Enter the list of allowed IP addresses to execute ssh commands:
ar: أدخل قائمة عناوين IP المسموح بها لتنفيذ أوامر ssh:
pt: Insira a lista de endereços IP permitidos para executar comandos ssh:

source: Authorized usernames or admins: those who can control your SSH server from your bot, you may skip it if you don't have an SSH server
ar: أسماء المستخدمين أو المسؤولين المعتمدين: أولئك الذين يمكنهم التحكم في خادم SSH الخاص بك من الروبوت الخاص بك، يمكنك تخطي ذلك إذا لم يكن لديك خادم SSH
pt: Nomes de usuário ou administradores autorizados: aqueles que podem controlar seu servidor SSH a partir do seu bot, você pode ignorá-lo se não tiver um servidor SSH

source: Enter authorized usernames (comma-separated):
ar: أدخل أسماء المستخدمين المصرح لهم (مفصولة بفاصلة):
pt: Insira nomes de usuário autorizados (separados por vírgula):

source: Do you want the bot to automatically detect server administrators as authorized users? y / n:
ar: هل تريد أن يقوم الروبوت بالكشف تلقائيًا عن مسؤولي الخادم كمستخدمين مصرح لهم؟ y / n:
pt: Você deseja que o bot detecte automaticamente os administradores do servidor como usuários autorizados? S/n:

source: Choose detection mode for accounts:
ar: اختر وضع الكشف للحسابات:
pt: Escolha o modo de detecção para contas:

source: 1: guest accounts
ar: 1: حسابات الضيوف
pt: 1: contas de visitantes

source: 2: All accounts
ar: 2: جميع الحسابات
pt: 2: Todas as contas

source: 3: Custom userName account
ar: 3: حساب اسم المستخدم المخصص
pt: 3: Conta de Usuário personalizada

source: Invalid choice. Please enter 1, 2, or 3.
ar: اختيار غير صالح. الرجاء إدخال 1 أو 2 أو 3.
pt: Escolha inválida. Insira 1, 2 ou 3.

source: Enter the custom username to detect:
ar: أدخل اسم المستخدم المخصص للكشف عن:
pt: Digite o nome de usuário personalizado para detectar:

source: TeamTalk license. Skip this section if you don't have a license
ar: ترخيص TeamTalk. تخط هذا القسم إذا لم يكن لديك ترخيص
pt: Licença TeamTalk. Pule esta seção se você não tiver uma licença

source: License name:
ar: اسم الترخيص:
pt: Nome da licença:

source: License key:
ar: مفتاح الترخيص:
pt: Chave de licença:

source: Created the config file
ar: تم إنشاء ملف التكوين

source: Config file error: {e}
ar: خطأ في ملف التكوين: {e}
pt: Erro no arquivo de configuração: {e}

source: Note: this error likely due to a missing part of the config file, Please delete your existing config file and create it again, If this issue persists: Please contact us
ar: ملاحظة: من المحتمل أن يكون هذا الخطأ بسبب جزء مفقود من ملف التكوين، يرجى حذف ملف التكوين الحالي وإنشاءه مرة أخرى، إذا استمرت هذه المشكلة: يرجى الاتصال بنا
pt: Observação: este erro provavelmente se deve à falta de uma parte do arquivo de configuração. Exclua o arquivo de configuração existente e crie-o novamente. Se o problema persistir: entre em contato conosco

source: Error saving bot config: {e}
ar: خطأ في حفظ تكوين الروبوت: {e}
pt: Erro ao salvar a configuração do bot: {e}

source: Get the current weather for your location or a specified user. Usage: /weather optional:nickname
ar: احصل على حالة الطقس الحالية لموقعك أو لمستخدم محدد. الاستخدام: /weather اختياري:nickname

source: Reboots the server (requires authorization)
ar: إعادة تشغيل الخادم (يتطلب الترخيص)

source: Executes a command on the server via SSH (requires authorization). Usage: /exec [command]
ar: تنفيذ أمر على الخادم عبر SSH (يتطلب تفويضًا). الاستخدام: /exec [أمر]

source: Search Wikipedia and get a summary. Usage: /search your query
ar: ابحث في ويكيبيديا واحصل على ملخص. الاستخدام: /search your query

source: Download a Wikipedia page as an HTML file. Usage: /file your query
ar: قم بتنزيل صفحة ويكيبيديا كملف HTML. الاستخدام: /file your query

source: Make the bot speak the given text. Usage: /say text
ar: اجعل الروبوت يتحدث بالنص المحدد. الاستخدام: /say text

source: Note
ar: ملحوظة

source: You can also use ' <text> for tts, it's the same as /say, just for ease of use
ar: يمكنك أيضًا استخدام ' <text> لـ tts، وهو نفس /say، فقط لسهولة الاستخدام

source: Enable or disable auto-translation for channel messages. Usage: /t <source_lang> <target_lang>
ar: تمكين أو تعطيل الترجمة التلقائية لرسائل القناة. الاستخدام: /t <source_lang> <target_lang>

source: Enable or disable private translate mode. Usage: /pt <source_lang> <target_lang>
ar: تمكين أو تعطيل وضع الترجمة الخاصة. الاستخدام: /pt <source_lang> <target_lang>

source: /voice voiceName
ar: /الصوت اسم الصوت

source: Set the voice name for text to speech.
ar: تعيين اسم الصوت للنص إلى كلام.

source: /rate value
ar: /قيمة المعدل

source: Set the voice rate, value from -100 to 100.
ar: ضبط معدل الصوت، القيمة من -100 إلى 100.

source: /pitch value
ar: /قيمة الملعب

source: Set the voice pitch, value from -100 to 100.
ar: ضبط درجة الصوت، القيمة من -100 إلى 100.

source: /volume value
ar: /قيمة الحجم

source: Set the voice volume, value from 0.1 to 1.0.
ar: ضبط مستوى الصوت، القيمة من 0.1 إلى 1.0.

source: /get_voices langcode
ar: /get_voices رمز اللغة

source: Get all voices for a specified language, if provided, if not: Get all available voices for all languages.
ar: احصل على جميع الأصوات للغة محددة، إذا كانت متوفرة، وإلا: احصل على جميع الأصوات المتوفرة لجميع اللغات.

source: Enable or disable language detection.
ar: تمكين أو تعطيل اكتشاف اللغة.

source: /db name duration
ar: /مدة اسم قاعدة البيانات

source: Admins only: Bans someone by IP address for a specified period.
ar: للمسؤولين فقط: حظر شخص ما عن طريق عنوان IP لفترة محددة.

source: /udb name duration
ar: /udb اسم المدة

source: Admins only: Bans a username for a specified period.
ar: للمسؤولين فقط: حظر اسم المستخدم لفترة محددة.

source: /dk name duration
ar: /dk مدة الاسم

source: Admins only: Kicks someone for a specified period.
ar: للمسؤولين فقط: يتم طرد شخص ما لفترة محددة.

source: /clear argument
ar: /حجة واضحة

source: Admins only: Clears the duration ban or kick for a specified user. If sent without arguments: Clears all duration ban and kick.
ar: للمسؤولين فقط: يزيل حظر المدة أو الطرد لمستخدم محدد. إذا تم الإرسال بدون وسيطات: يزيل حظر المدة والطرد بالكامل.

source: Admins only: Stop streaming a speech file.
ar: للمسؤولين فقط: إيقاف بث ملف الكلام.

source: /b message
ar: /ب الرسالة

source: Admins only: Sends a broadcast message to the server.
ar: المسؤولون فقط: يرسل رسالة بث إلى الخادم.

source: /jail <name>
ar: /jail <الاسم>

source: For authorized users only, Adds someone to the jails list and move them to the jail channel. This adds the username to the list and not the nickname.
ar: للمستخدمين المصرح لهم فقط، يضيف شخصًا إلى قائمة السجون وينقله إلى قناة السجن. يؤدي هذا إلى إضافة اسم المستخدم إلى القائمة وليس الاسم المستعار.

source: /unjail <name>
ar: /إلغاء سجن <الاسم>

source: For authorized users. Removes someone from the jails list and moves them back to the root channel
ar: للمستخدمين المصرح لهم. يزيل شخصًا ما من قائمة السجون وينقله مرة أخرى إلى القناة الجذرية

source: Admins only: Gets the list of users who are in the jails list
ar: المسؤولون فقط: الحصول على قائمة المستخدمين الموجودين في قائمة السجون

source: /cn <new name
ar: /cn <اسم جديد

source: Admins only: Changes the bot's name.
ar: للمسؤولين فقط: تغيير اسم الروبوت.

source: /cs <status>
ar: /cs <الحالة>

source: Admins only: Changes the status message
ar: المسؤولون فقط: تغيير رسالة الحالة

source: /cg mode
ar: /وضع cg

source: Admins only: Changes the bot's gender. Available modes: m for male, f for female, n for neutral.
ar: للمسؤولين فقط: تغيير جنس الروبوت. الأوضاع المتاحة: m للذكر، f للإناث، n للمحايد.

source: /private <name>
ar: /خاص <الاسم>

source: Moves you and another one to a private hidden channel where no one can see it. This channel is only limited to 2 users only and will be deleted after both users log out of the server.
ar: ينقلك أنت وشخص آخر إلى قناة خاصة مخفية حيث لا يستطيع أحد رؤيتها. تقتصر هذه القناة على مستخدمين اثنين فقط وسيتم حذفها بعد تسجيل خروج كلا المستخدمين من الخادم.

source: Admins only: Saves the configuration in case you changed the bot's name and want to save it.
ar: للمسؤولين فقط: يحفظ التكوين في حالة تغيير اسم الروبوت وترغب في حفظه.

source: Show this help message.
ar: إظهار رسالة المساعدة هذه.

source: Could not connect to server
pt: Não foi possível conectar ao servidor

source: address
pt: endereço

source: port =
pt: porta =

source: intercepting channel messages for user {ttstr(user.szNickname)}
pt: interceptando mensagens de canal para o usuário {ttstr(user.szNickname)}

source: Rate set to {rate_value}.
pt: * Taxa definida como {rate_value}.

source: Pitch set to {pitch_value}.
pt: Tom definido como {pitch_value}.

source: Volume set to {volume_value}.
pt: Volume definido como {volume_value}.

source: Hello. Important: The user {nickname} has logged in to the server.
pt: Olá. Importante: O usuário {nickname} efetuou login no servidor.

source: You have a message from {sender_username} ({sender_nickname}): {message}
pt: Você recebeu uma mensagem de {sender_username} ({sender_nickname}): {message}

source: Duration ban (IP) activated for {ttstr(user.szNickname)}
pt: Duração do banimento (IP) ativado para {ttstr(user.szNickname)}

source: Duration ban (Username) activated for {ttstr(user.szNickname)}
pt: Duração do banimento (nome de usuário) ativado para {ttstr(user.szNickname)}

source: {ttstr(user.szNickname)} has been banned for using a VPN.
pt: {ttstr(user.szNickname)} foi banido por usar VPN.

source: {ttstr(user.szNickname)} has been kicked due to username exceeding {self.bot_config['char_limit']} characters.
pt: {ttstr(user.szNickname)} foi chutado porque o nome de usuário excedeu {self.bot_config['char_limit']} caracteres.

source: You have been kicked due to username exceeding {self.bot_config['char_limit']} characters.
pt: Você foi expulso porque o nome de usuário excedeu {self.bot_config['char_limit']} caracteres.

source: Hey {ttstr(user.szNickname)}, This is not the place for you and your country {country}. Go away.
pt: Olá, {ttstr(user.szNickname)}, este não é o lugar para você e seu país {country}. Vá embora.

source: Welcome, {ttstr(user.szNickname)} from {country}!
pt: Bem vindo, {ttstr(user.szNickname)} de {country}!

source: Ahoy there, {ttstr(user.szNickname)} from {country}! Welcome aboard!
pt: Olá, {ttstr(user.szNickname)} de {country}! Bem-vindo a bordo!

source: Greetings, {ttstr(user.szNickname)} of {country}! We're glad to have you here.
pt: Saudações, {ttstr(user.szNickname)} de {country}! Estamos felizes em ter você aqui.

source: Howdy, {ttstr(user.szNickname)}! Welcome from {country}.
pt: Olá, {ttstr(user.szNickname)}! Bem-vindo de {país}.

source: Whoa! {ttstr(user.szNickname)} just arrived from {country}! Let's party!
pt: Uau! {ttstr(user.szNickname)} acabou de chegar de {country}! Vamos festejar!

source: Look who's here! {ttstr(user.szNickname)} from {country} just logged in!
pt: Olha quem está aqui! {ttstr(user.szNickname)} de {country} acabou de fazer login!

source: Good vibes only for {ttstr(user.szNickname)} from {country}! Welcome, my friend!
pt: Boas vibrações apenas para {ttstr(user.szNickname)} de {country}! Bem-vindo, meu amigo!

source: Surprise, surprise! It's {ttstr(user.szNickname)} from {country}! Glad to have you!
pt: Surpresa, surpresa! É {ttstr(user.szNickname)} de {country}! Que bom ter você!

source: Let the fun begin! Welcome, {ttstr(user.szNickname)} from the land of {country}!
pt: Deixe a diversão começar! Bem-vindo, {ttstr(user.szNickname)} da terra de {country}!

source: cannot identify the country name for that IP address likely due to an invalid IP address: {ttstr(user.szIPAddress)}
pt: não é possível identificar o nome do país para esse endereço IP, provavelmente devido a um endereço IP inválido: {ttstr(user.szIPAddress)}

source: {ttstr(user.szNickname)} has joined the server
pt: {ttstr(user.szNickname)} ingressou no servidor

source: {ttstr(user.szNickname)} has been banned due to jail flood protection.
pt: {ttstr(user.szNickname)} foi banido devido à proteção contra inundação na prisão.

source: Message received: {ttstr(textmessage.szMessage)} from {ttstr(textmessage.szFromUsername)}
pt: Mensagem recebida: {ttstr(textmessage.szMessage)} de {ttstr(textmessage.szFromUsername)}

source: User '{rest[0]}' not found.
pt: Usuário '{rest[0]}' não encontrado.

source: {ttstr(user.szNickname)} says: {translated}
pt: {ttstr(user.szNickname)} diz: {traduzido}

source: Using voice for {detected_lang}: {voice_name}
pt: Usando voz para {detected_lang}: {voice_name}

source: Name: {voice['FriendlyName']}, ShortName: {voice['ShortName']}, Locale: {voice['Locale']}
pt: Nome: {voice['FriendlyName']}, ShortName: {voice['ShortName']}, Local: {voice['Locale']}

source: Error getting location: {data.get('message')} for IP: {ip_address}
pt: Erro ao obter localização: {data.get('message')} for IP: {ip_address}

source: The current weather in {city}, {country_name} is {temperature}\u00B0C, {condition}. The perceived temperature is {feels_like} degrees C, the wind speed is at {wind_speed} kilometers per hour, The wind gusts are at {gust_kph} kilometers per hour, The windchill is {windchill_c}\u00B0C, The Precipitation is {precip_mm} MM, The cloudiness is of {cloudiness}%. There is a {chance_of_rain}% chance of rain, And the visibility is up to {visibility} kilometers. The humidity is {humidity}%, The current time is {time}.
pt: O clima atual em {city}, {country_name} é {temperature}\u00B0C, {condition}. A temperatura percebida é {feels_like} graus C, a velocidade do vento é de {wind_speed} quilômetros por hora, As rajadas de vento são de {gust_kph} quilômetros por hora, A sensação térmica é de {wind_c}\u00B0C, A precipitação é de {precip_mm} MM , A nebulosidade é de {nublado}%. Há {chance_of_rain}% de chance de chuva e a visibilidade é de até {visibility} quilômetros. A umidade é {umidade}%, A hora atual é {hora}.

source: You are the only one from {user_country}.
pt: Você é o único de {user_country}.

source: There are {count} users from {user_country}.
pt: Existem {count} usuários de {user_country}.

source: Downloading: {self.player.media_title}
pt: Baixando: {self.player.media_title}

source: File {filename_only} downloaded successfully. Uploading to the server...
pt: Arquivo {filename_only} baixado com sucesso. Fazendo upload para o servidor...

source: Error downloading or uploading: {str(e)}
pt: Erro ao fazer download ou upload: {str(e)}

source: Error deleting file: {str(e)}
pt: Erro ao excluir arquivo: {str(e)}

source: {ttstr(user.szNickname)} requested playing from a URL
pt: {ttstr(user.szNickname)} solicitou a reprodução de um URL

source: {ttstr(user.szNickname)} requested to play: {first_video_title}
pt: {ttstr(user.szNickname)} solicitou a reprodução de: {first_video_title}

source: Playing: {previous_video_title}
pt: Reproduzindo: {previous_video_title}

source: {ttstr(user.szNickname)} stopped the playback
pt: {ttstr(user.szNickname)} interrompeu a reprodução

source: Maximum allowed volume is {self.playback_config['max_volume']}
pt: O volume máximo permitido é {self.playback_config['max_volume']}

source: The current volume is {int(self.player.volume)}
pt: O volume atual é {int(self.player.volume)}

source: {ttstr(user.szNickname)} paused the playback
pt: {ttstr(user.szNickname)} pausou a reprodução

source: Total duration: {self.player.format_time(self.player.duration)}. Elapsed time: ){self.player.format_time(elapsed_time)}. Remaining time: {self.player.format_time(remaining_time)}
pt: Duração total: {self.player.format_time(self.player.duration)}. Tempo decorrido: ){self.player.format_time(elapsed_time)}. Tempo restante: {self.player.format_time(remaining_time)}

source: {ttstr(user.szNickname)} requested to play {self.player.media_title} from history
pt: {ttstr(user.szNickname)} solicitou a reprodução de {self.player.media_title} do histórico

source: Alright. You will be notified when {nickname} logs in to the server.
pt: Tudo bem. Você será notificado quando {nickname} fizer login no servidor.

source: Pending message. to: {sender_data['sender_username']} ({sender_data['sender_nickname']}): {sender_data['message']}
pt: Mensagem pendente. para: {sender_data['sender_username']} ({sender_data['sender_nickname']}): {sender_data['message']}

source: Pending message. to: {sender_data.get('sender_username', 'Unknown User')} ({sender_data['sender_nickname']}): {sender_data['message']}
pt: Mensagem pendente. para: {sender_data.get('sender_username', 'Usuário desconhecido')} ({sender_data['sender_nickname']}): {sender_data['message']}

source: User Info:
pt: Informações do usuário:

source: Nickname: {nickname}
pt: Apelido: {nickname}

source: Username: {username}
pt: Nome de Usuário: {username}

source: Password: {password}
pt: Senha: {password}

source: IP Address: {ip_address}
pt: Endereço IP: {ip_address}

source: Status Message: {status_message}
pt: Mensagem de status: {status_message}

source: {ttstr(user.szNickname)} has been kicked for {duration_str}.
pt: {ttstr(user.szNickname)} foi expulso por {duration_str}.

source: {ttstr(user.szNickname)} has been banned for {duration_str}.
pt: {ttstr(user.szNickname)} foi banido por {duration_str}.

source: {ttstr(user.szNickname)} (IP ban) has been unbanned.
pt: {ttstr(user.szNickname)} (banimento de IP) foi cancelado.

source: {ttstr(user.szNickname)} (Username ban) has been unbanned.
pt: {ttstr(user.szNickname)} (banimento de nome de usuário) foi cancelado.

source: {ttstr(user.szNickname)} has been jailed.
pt: {ttstr(user.szNickname)} foi preso.

source: {ttstr(user.szNickname)} has been unjailed.
pt: {ttstr(user.szNickname)} foi liberado.

source: Jailed users: {jailed_users_str}
pt: Usuários presos: {jailed_users_str}

source: Cleared bans and duration kicks for {ttstr(target)}.
pt: Banimentos e chutes de duração removidos para {ttstr(target)}.

source: Cleared duration kick for {ttstr(target)}.
pt: Chute de duração cancelado para {ttstr(target)}.

source: Target '{ttstr(target)}' not found.
pt: Target '{ttstr(target)}' não encontrado.

source: Error: {data.get('message')} for IP: {ip_address}
pt: Erro: {data.get('message')} para IP: {ip_address}

source: Configuration
pt: Configuração
